#!python3
# -*- coding: utf-8 -*-
from collections import OrderedDict
import sys

wkkanji = "一,下,九,口,工,三,山,七,十,女,上,人,川,大,二,入,八,力,々,右,円,王,火,丸,玉,月,犬,五,左,才,四,子,手,出,小,水,正,千,中,丁,天,田,土,刀,日,白,文,本,又,木,目,夕,立,了,六,引,外,牛,元,古,戸,午,公,広,今,市,止,少,心,生,切,太,台,冬,内,半,父,分,母,方,北,万,毛,矢,友,用,央,花,貝,気,休,去,見,号,皿,仕,糸,字,耳,写,車,主,申,世,石,赤,先,早,足,村,他,打,代,男,竹,虫,町,年,百,氷,不,平,宝,名,礼,羽,雨,音,何,会,回,角,学,斤,近,金,空,兄,形,言,交,光,考,行,作,自,社,色,図,声,西,青,草,走,多,体,谷,弟,当,同,肉,麦,皮,米,毎,来,里,林,安,化,科,画,海,活,京,曲,血,後,向,国,姉,思,死,私,次,室,首,州,食,星,前,全,知,地,茶,長,直,店,点,東,南,歩,亡,妹,明,夜,有,羊,両,以,黄,夏,家,記,魚,強,教,欠,校,高,黒,札,氏,紙,時,失,弱,週,雪,船,組,鳥,通,必,付,風,辺,末,未,民,由,理,医,雲,絵,楽,間,究,局,君,決,研,支,者,住,所,助,場,森,身,数,対,池,朝,電,投,答,道,馬,買,反,番,役,話,泳,屋,仮,界,客,苦,具,県,験,使,試,事,持,実,受,重,勝,乗,新,相,送,談,定,度,売,発,美,表,負,部,服,物,返,保,予,要,和,飲,院,運,横,歌,開,漢,顔,起,求,業,軽,語,最,算,始,酒,終,習,集,親,進,線,速,調,鉄,転,頭,読,農,配,病,聞,鳴,葉,落,路,位,意,育,岸,級,競,共,功,好,指,拾,初,神,成,昔,戦,争,仲,注,追,低,伝,努,働,特,波,秒,別,便,放,味,命,洋,利,良,令,労,老,悪,員,温,階,寒,期,球,港,合,根,祭,歯,暑,商,消,章,植,深,泉,息,族,待,第,短,着,庭,登,都,島,湯,動,童,倍,勉,僕,野,陽,流,旅,暗,映,駅,億,課,皆,感,館,願,器,疑,橋,鏡,銀,殺,士,詩,謝,宿,賞,情,整,選,然,想,像,題,熱,標,福,問,様,養,料,緑,輪,練,囲,格,完,頑,基,希,季,技,協,芸,固,骨,材,参,残,周,術,松,性,折,束,卒,妥,的,念,能,雰,望,約,例,英,岩,帰,紀,泣,区,軍,計,建,坂,昨,司,寺,式,秋,春,丈,信,晴,浅,単,築,昼,毒,猫,飯,晩,夫,仏,変,法,勇,列,園,遠,荷,関,危,急,係,険,幸,阪,治,辞,取,守,書,笑,証,冗,真,政,専,存,典,箱,品,府,弁,冒,面,門,曜,浴,留,愛,因,栄,塩,果,覚,官,干,喜,虚,警,劇,結,原,幻,細,察,識,署,渉,詳,常,是,席,説,側,底,堂,敗,梅,悲,非,鼻,兵,無,薬,恋,飴,煙,可,汽,祈,喫,弓,許,胸,禁,句,訓,喉,告,座,借,種,焼,静,洗,禅,僧,叩,達,等,脳,報,忘,枚,類,易,宇,加,改,減,昆,混,財,冊,史,詞,若,順,節,舌,善,続,団,宙,笛,徒,得,閥,比,布,忙,暴,容,絡,乱,履,歴,連,圧,械,害,確,機,議,経,穴,嫌,個,厚,困,妻,災,在,罪,産,臭,尻,震,倒,難,犯,被,飛,尾,妨,防,夢,裕,余,率,論,委,岡,解,企,義,挙,件,検,権,査,済,際,資,省,条,審,制,税,責,設,羨,素,総,増,断,敵,任,認,派,判,批,評,務,案,域,営,援,応,価,過,賀,各,観,吸,宮,策,姿,示,状,寝,勢,袖,態,脱,誕,値,置,提,諦,統,藤,罰,費,副,坊,領,演,革,割,幹,看,規,鬼,現,呼,護,裁,崎,師,施,収,秀,準,城,職,則,宅,沢,張,停,導,乳,俳,備,優,律,贅,違,額,株,環,管,供,境,狭,型,肩,腰,差,載,視,質,祝,述,象,触,製,層,担,庁,展,届,燃,販,武,輸,量,腕,隠,影,掛,巻,慣,含,居,況,響,景,限,候,効,構,絞,訟,鮮,訴,捜,捉,属,替,逮,渡,輩,抜,肥,票,捕,補,豊,満,模,与,印,鉛,往,河,菓,我,怪,較,汗,激,故,再,刺,授,従,獣,障,振,針,接,占,創,造,貯,徴,討,独,突,豚,筆,復,郵,励,胃,暇,給,極,屈,靴,健,康,就,招,昇,症,織,睡,貸,退,端,段,痛,締,途,怒,悩,濃,迫,腹,訪,眠,迷,誘,郎,惑,移,益,奇,逆,巨,撃,潔,券,憲,庫,攻,傘,児,修,衆,処,清,精,絶,隊,稚,程,凍,博,微,浜,婦,並,妙,幼,冷,麗,録,綺,宴,欧,壊,街,閣,乾,監,韓,寄,詰,恐,緊,江,航,催,索,宗,臣,診,請,積,促,添,督,杯,板,怖,娘,猛,雄,略,僚,烈,越,延,押,快,懐,渇,旗,系,更,購,婚,撮,照,飾,騒,適,盗,匂,濡,背,版,貧,浮,符,乏,枕,魅,遊,預,翌,覧,漏,華,貨,鑑,幾,既,救,驚,均,径,豪,菜,散,似,除,尋,倉,掃,巣,孫,帯,嘆,探,偵,泥,徳,富,普,粉,編,墓,棒,脈,融,離,陸,廊,永,衛,液,汚,恩,眼,机,久,興,迎,厳,込,採,桜,雑,賛,酸,志,飼,捨,序,傷,績,染,銭,祖,暖,党,秘,複,密,訳,欲,卵,異,噂,灰,拡,簡,筋,敬,皇,砂,誌,熟,諸,蒸,垂,盛,宣,操,窓,装,蔵,尊,忠,著,賃,糖,納,肺,漠,否,閉,暮,裏,芋,沿,歓,揮,貴,勤,源,誤,紅,降,刻,枝,磁,射,縦,縮,純,承,推,粋,聖,薦,痩,臓,損,爪,吐,奴,豆,拝,腐,幕,隷,丼,為,炎,介,亀,熊,剣,己,湖,互,講,獄,舎,寿,汁,紹,醤,酢,酔,杉,噌,測,滞,恥,遅,喋,彫,銅,鍋,破,彼,払,厄,油,依,維,遺,沖,牙,核,換,甘,伎,及,旧,継,献,債,鮭,鹿,将,伸,姓,諾,超,津,摘,踏,奈,縄,廃,般,舞,幅,貿,盟,頼,療,患,漁,串,刑,契,恵,掲,遣,抗,香,削,執,旬,償,昭,陣,跡,狙,葬,弾,兆,聴,跳,抵,闘,爆,眉,募,崩,抱,戻,臨,塁,湾,扱,奥,刊,緩,還,宜,却,繰,傾,懸,需,緒,称,娠,奏,贈,択,託,致,逃,妊,伴,盤,避,膝,描,併,房,抑,慮,齢,賂,賄,宛,稲,勧,岐,棋,拒,群,圏,謙,雇,御,控,甲,鋼,項,埼,祉,充,渋,銃,譲,慎,仙,奪,斐,阜,壁,片,邦,埋,免,躍,隆,鈴,枠,鋭,雅,戒,獲,嬉,犠,駆,携,兼,顧,孝,剤,俊,巡,唱,衝,殖,吹,柱,駐,殿,透,排,薄,繁,頻,敏,敷,褒,堀,茂,誉,妖,隣,衣,嘘,嘩,艦,棄,偽,儀,拠,郷,蛍,喧,拳,虎,鉱,伺,至,樹,侵,仁,瀬,凄,誠,潜,措,遜,炭,酎,徹,撤,畑,包,蜂,蜜,墟,握,潟,括,滑,肝,糾,掘,堅,弧,綱,荒,克,斎,暫,軸,芝,床,焦,枢,析,双,喪,袋,挑,哲,到,泊,範,紛,柄,網,揚,揺,威,慰,垣,岳,距,琴,貢,懇,刷,擦,旨,滋,趣,襲,柔,沼,斉,籍,即,泰,誰,懲,潮,沈,珍,筒,封,撲,牧,摩,滅,裂,炉,露,朗,挨,縁,俺,芽,笠,缶,吉,丘,叫,娯,拶,侍,叱,朱,辛,刃,寸,棚,釣,斗,塔,桃,謎,忍,髪,匹,姫,砲,翼,雷,嵐,梨,粒,竜,涙,井,陰,嫁,稼,塊,脚,凶,狂,菌,溝,硬,頃,魂,湿,狩,呪,舟,塾,鐘,嬢,澄,滝,卓,眺,賭,曇,肌,疲,磨,矛,也,裸,霊,暦,翔,椅,猿,穏,架,菊,鍵,誇,吾,碁,孔,歳,斬,瞬,庄,租,阻,鍛,帝,棟,瞳,鈍,寧,鳩,俵,癖,穂,泡,墨,盆,魔,綿,黙,幽,寮,涼,零,錬,哀,伊,崖,欺,巾,憩,恨,佐,詐,砕,尺,掌,粧,畳,唇,芯,炊,扇,爽,挿,憎,墜,滴,胴,虹,如,粘,婆,箸,扉,塀,幣,帽,霧,柳,瞭,闇,殴,憶,蚊,餓,悔,穫,輝,飢,騎,脅,隙,賢,彩,咲,斜,蛇,盾,辱,尽,迅,遂,霜,耐,畜,蓄,帳,貼,塗,灯,培,鉢,班,麻,溶,踊,脇,概,隔,刈,勘,駒,桑,悟,慌,拘,剛,紫,煮,珠,蹴,潤,奨,浸,衰,征,誓,礎,俗,拓,淡,壇,抽,鶴,陶,尼,妃,覆,陛,謀,唯,劣,疫,堰,蟹,涯,軌,仰,偶,后,巧,諮,邪,彰,晶,壮,駄,亭,堤,廷,訂,唐,洞,把,伯,搬,漂,墳,奮,簿,峰,翻,漫,銘,淀,鰐,鬱,偉,渦,浦,喚,挟,襟,隅,郡,軒,玄,枯,耕,肯,郊,脂,慈,釈,召,隻,燥,聡,濯,頂,塚,貞,邸,軟,媛,苗,瓶,膚,沸,肪,亮,蓮,綾,茨,貫,陥,遇,孤,恒,唆,鎖,殊,祥,須,牲,遭,惰,怠,秩,陳,乃,覇,賠,隼,噴,偏,輔,芳,膨,没,慢,擁,猟,糧,倫,呂,颯,葵,緯,瓜,寛,虐,錦,啓,胡,鯉,稿,惨,駿,准,曙,徐,剰,壌,浄,帥,随,据,繊,戴,丹,艇,搭,騰,披,緋,舗,胞,蒙,諭,諒,莉,阿,茜,杏,逸,卸,拐,且,鎌,冠,愚,勲,茎,鯨,顕,酷,栽,疾,酬,粛,庶,叙,尚,践,疎,荘,痴,呈,呆,紋,悠,謡,欄,傲,哺,栞,瑛,佳,該,郭,憾,凝,循,昌,髄,惜,脊,栓,粗,旦,鎮,悼,栃,那,尿,之,賓,赴,伏,奉,傍,朴,抹,弥,愉,癒,憂,龍,虜,遼,累,尉,悦,嘉,轄,窮,恭,弦,呉,洪,穀,宰,搾,錯,柴,寂,匠,紳,摂,智,窒,蝶,拍,舶,縛,碑,弊,縫,飽,凡,靖,猶,庸,遥,陵,凛,烏,閲,凹,乙,喝,敢,款,峡,鼓,衡,酵,紺,哉,遮,醸,旋,槽,蒼,賊,堕,胎,弔,腸,漬,坪,凸,伐,楓,遍,俸,萌,膜,盲,羅,瑠,慨,殻,戯,朽,享,暁,鶏,傑,絹,赦,酌,淑,肖,錠,嘱,瑞,菅,窃,濁,椎,迭,媒,陪,帆,藩,扶,譜,憤,剖,奔,璃,硫,凌,漣,亜,梓,姻,詠,禍,堪,閑,忌,擬,吟,慶,沙,雌,漆,叔,礁,甚,崇,拙,遷,曹,汰,胆,鋳,憧,峠,篤,屯,卑,侮,蔑,紡,睦,岬,酪,浪,唄,寡,劾,矯,謹,渓,倹,狐,坑,拷,桟,囚,醜,殉,升,逝,漸,藻,匿,畔,煩,蛮,泌,罷,慕,某,婿,妄,湧,藍,痢,廉"
wkkanji = set(wkkanji.split(','))

filename = (len(sys.argv) > 1 and sys.argv[1]) or 'japanesedata.txt'
print("opening for analysis: ", filename)

with open(filename, 'r') as file:
    data = file.read().replace('\n', '')
    d = OrderedDict.fromkeys(data)
    intersection = [
    	word for word in d.keys() 
    	if (
            word not in wkkanji and 
            (ord(word) > ord("ン"))
        )
    ]
    cjkideo = [moji for moji in intersection 
        if ord(moji) >= 0x4e00 and ord(moji) <= 0x9fff
    ]
    cjkideoA = [moji for moji in intersection # U+3400..U+4DBF
        if ord(moji) >= 0x3400 and ord(moji) <= 0x4DBF
    ]
    cjkcompat = [moji for moji in intersection # U+F900..U+FAFF
        if ord(moji) >= 0xF900 and ord(moji) <= 0xFAFF
    ]
    cjkideoBtoH = [moji for moji in intersection
        if ord(moji) >= 0x20000 and ord(moji) <= 0x323AF
    ]
    print('other', ''.join(moji for moji in intersection if moji not in cjkideo))
    print('cjk unified ideographs extension A: ', ''.join(cjkideoA))
    print('cjk unified ideographs extension B~H: ', ''.join(cjkideoBtoH))
    print('cjk compatibility: ', ''.join(cjkcompat))
    print('cjk unified ideographs: ', ''.join(cjkideo))
    sys.stdout.flush()

    import fugashi
    # allkanji = cjkideo + cjkideoA + cjkcompat + cjkideoBtoH
    # tagger = fugashi.Tagger()
    # words = [word for word in tagger(data)]
    # wordset = OrderedDict()
    # for kanji in allkanji:
    # 	for word in words:
    # 		if kanji in word.surface:
    # 			wordset[word.surface] = True
    # print("\nwords", *(w for w in wordset.keys()))
